test/load/burst_test.yml
config:
  target: 'https://172.17.43.59:5001'
  http:
    tls:
      rejectUnauthorized: false
  plugins:
    statsd:
      host: ''
      port: 8125
      prefix: 'artillery'
  payload:
      # path is relative to the location of the test script
      path: "./productslist.csv"
      fields:
        - "productid"
  phases: 
    - duration: 300
      arrivalRate: 0
      rampTo: 20
    - duration: 10
      arrivalRate: 100
    - duration: 300
      arrivalRate: 20
      name: "burst" #Every 6 seconds 1 user will be added
  variables:
      testurl:
        - "/"
scenarios:
  - flow:
    - get:
        url: "/store/c/free-%26-clear-shampoo/ID=prod{{productid}}-product?reactjs=true"
    - get:
        url: "/vpd/v1/products/{{productid}}/(PriceInfo+Inventory+ProductDetails)"